{
  "hello": "Hello, world!",
  "fr": "French",
  "en": "English",
  "home": "Home",
  "about": "About me",
  "services": "Services",
  "projects": "Projects",
  "awards": "Awards",
  "certifications": "Certifications",
  "contact": "Contact",
  "preferences": "Preferences",
  "download": "Download",
  "profil_1": "I'm a Software Engineer",
  "profil_2": "I aspire to Smart Systems",
  "profil_3": "I'm passionate about AI",
  "profil_4": "I'm passionate about IOT",
  "short_description": "Passionate about technological innovation, I firmly believe in the power of technology to solve real-world problems in a variety of fields.",
  "description": "I'm Charlot DEDJINOU, a professional with a passion for technology. As a developer and enthusiast of artificial intelligence and the Internet of Things, I'm committed to creating innovative solutions to real-world challenges. With a diverse range of expertise, I'm determined to push back the boundaries of technology to shape a better future.",
  "experience": "Experience",
  "degree": "Degree",
  "website": "Website",
  "city": "City",
  "licence": "Bachelor's degree",
  "email": "Email",
  "phone": "Phone",
  "freelance": "Freelance",
  "remote": "Remote",
  "linkedln": "Linkedln",
  "github": "Github",
  "available": "Available",
  "benin": "Benin",
  "view": "view",
  "education": "Education",
  "professional_experience": "Professional Experience",
  "my": "My",
  "years": "Years",
  "place": "Place",
  "skills": "Skills",

  "developer_frontend": "Frontend Web Developer",
  "developer_fullstack": "Full Stack Developer",

  "fusion_sites": "Merged three WordPress sites into a single optimized platform",
  "react_frontend": "Frontend development with React.js for improved performance and maintainability.",

  "uml_modeling": "System design using UML diagrams",
  "figma_mockup": "UI mockup design with Figma",
  "react_frontend_dev": "Frontend development with React.js",
  "laravel_api": "API development with Laravel",
  "react_redux_laravel": "Full-stack development with React.js, Redux, Laravel, Tailwind CSS, and Bootstrap",
  "vps_deployment": "VPS deployment and infrastructure management (Nginx, PM2, HTTPS, domain)",

  "uac_portal_ui": "UI development for UAC's academic portal using React.js",
  "api_integration": "API integration for dynamic data fetching and display",

  "bachelor": "Professional Bachelor's Degree in Software Engineering",
  "mastercard": "Mastercard Foundation Scholarship Program",
  "bachelor_science": "High School Diploma - Science (Series C)",

  "ifri": "Institut de Formation et de Recherche en Informatique (IFRI), Abomey-Calavi, Benin",
  "university_abomey": "University of Abomey-Calavi, Benin",
  "cotonou": "CEG L'Entente, Cotonou, Benin",

  "mention_tb_1614": "Graduated with honors (GPA: 16.14/20)",
  "mention_tb_1681": "Graduated with honors (GPA: 16.81/20)",
  "software_engineering": "Focus on Software Engineering",
  "mastercard_scholar": "Scholar of the Mastercard Foundation Program",
  "cohort_leader": "Cohort 5 Student Representative (2023-2024)",
  "class_leader": "Class representative in senior and junior years",

  "web_development": "Web Development",
  "web_development_description": "Create dynamic and interactive websites, offering exceptional user experience and customized features.",
  "mobile_apps": "Mobile Application",
  "mobile_apps_description": "Design high-performing mobile applications for iOS and Android, offering elegant user interfaces and innovative features.",
  "api_development": "API Development",
  "api_development_description": "Design, develop, and deploy robust APIs to enable integration and interaction between different applications and systems.",
  "data_analysis": "Data Analysis & Prediction",
  "data_analysis_description": "Analyse complex datasets to extract meaningful insights and build predictive models.",
  "iot_solutions": "IoT Integration Solutions",
  "iot_solutions_description": "Develop intelligent IoT solutions to collect, analyze, and utilize data for enhanced decision-making and automation.",
  "user_interfaces": "User Interfaces (UI/UX)",
  "user_interfaces_description": "Create intuitive and aesthetically pleasing interfaces for websites and mobile applications as well as visuals for events.",
  "stock_master": "Stock Master",
  "stock_master_description": "Stock Master is a powerful and intuitive mobile stock management application designed to simplify the management of product stocks.",
  "iot_hub": "Internet of Things Hub",
  "iot_description": "Explore my practical Internet of Things (IoT) projects in this GitHub repository! Discover code examples, and demonstrations covering various aspects of IoT.",
  "data_science_hub": "Data Science Hub",
  "data_science_hub_description": "A repository containing a variety of practical exercises, training projects, and hands-on work in data science.",
  "artistic_ecommerce": "Artistic E-commerce",
  "artistic_ecommerce_description": "A web application developed in React JS offering a platform for artisans to sell their artistic creations online.",
  "car_rental_management": "Car Rental Management",
  "car_rental_management_description": "A car rental management application developed with PHP, Laravel, and MySQL for efficient search, booking, and management.",
  "birthday_celebration_hub": "Birthday Celebration Hub",
  "birthday_celebration_hub_description": "An interactive site allowing customization of birthday wishes with visuals, riddles to unlock additional features. The default password to access the site is incorrect.",
  "maic_morabaraba_ai": "Maic Morabaraba AI",
  "maic_morabaraba_ai_description": "A participation in the Maic International 2022 competition with the development of an artificial intelligence capable of playing the Morabaraba game.",
  "hackathon_sene": "Hackathon SENE",
  "hackathon_sene_description": "A digital solution developed during the SENE competition to simplify the management of Waste Electrical and Electronic Equipment (WEEE).",
  "python_kattis_solutions": "Python Kattis Solutions",
  "python_kattis_solutions_description": "A repository containing solutions to some Kattis exercises, all coded in Python, to solve various algorithmic and programming problems.",
  "websocket_communication": "Websocket Communication",
  "websocket_communication_description": "A bidirectional communication application between a server and clients, allowing instant message exchange via websockets and message recording in a database.",
  "event_flow": "EventFlow",
  "event_flow_description": "EventFlow is a guest management application for an event. It allows you to add, update, delete, and search for guests, mark guests as present or absent, and generate an overall statistic at the end.",
  "algolia": "AlgoliaSearch",
  "algolia_description": "AlgoliaSearch is a Laravel application that leverages Algolia for advanced search functionality. It is built using the Algolia Scout Extended package version 1.0 and is compatible with PHP 7.1.3 and Laravel 5.6",
  "zero_plastic_initiative": "Zero Plastic Initiative",
  "zero_plastic_initiative_description": "A feature developed for the Zero Plastic Waste project on the Abomey Calavi campus, allowing the generation of a personalized I'll be there link to share commitments and photos on social networks.",
  "interview_ai_platform": "Interview AI Platform",
  "interview_ai_platform_description": "A platform allowing to simulate an online interview with questions generated by a ChatGPT-based API, offering a realistic experience and suggestions for answers.",
  "treasure_hunt_adventure": "Treasure Hunt Adventure",
  "treasure_hunt_adventure_description": "An interactive adventure based on a React web application, where each step of the quest is a puzzle to solve to progress and discover the coveted treasure.",
  "tp_knn": "TP kNN",
  "tp_knn_description": "A practical work exploring the selection of the number of neighbors in the k nearest neighbors (kNN) algorithm to optimize the accuracy of classification or regression models.",
  "excellence_night_celebration": "Excellence Night Celebration",
  "excellence_night_celebration_description": "A feature developed for the Excellence Night at UAC, allowing to generate a personalized I'll be there link to share visuals on social networks.",
  "tp_mushroom_classification": "TP Mushroom Classification",
  "tp_mushroom_classification_description": "A practical work where a logistic regression and a linear SVM are trained to determine the edibility of mushrooms from the Kaggle mushrooms dataset.",
  "realtime_chatbot": "RealTime Chatbot",
  "realtime_chatbot_description": "A project of instant messaging between two people using websockets, Vue.js for the frontend, and Express.js for the backend, offering a smooth and responsive messaging experience.",
  "blog_api": "Blog API",
  "blog_api_description": "Project to develop a blog API with Laravel, focused on two models: Comments and Articles.",
  "virtual_smartphone_experience": "Virtual Smartphone Experience",
  "virtual_smartphone_experience_description": "A project presenting a virtual Smartphone with several functional applications for a complete user experience, including WhatsApp, games, a media player, a task scheduler, etc.",
  "yats_mobile_game_interface": "YATS Mobile Game Interface",
  "yats_mobile_game_interface_description": "A contribution to the development of the home page interface of a mobile game showcasing the art and culture of Benin during the YATS event.",
  "api_deee_manager": "API DEEE Manager",
  "api_deee_manager_description": "An API developed in PHP for efficient management of Waste Electrical and Electronic Equipment (WEEE), allowing the collection, tracking, and transparent management of these wastes.",
  "flutter_shared_preferences_demo": "Flutter Shared Preferences Demo",
  "flutter_shared_preferences_demo_description": "A demonstration of using the Shared Preferences library in Flutter for managing user preferences in a mobile application, offering simple and efficient storage of key-value data on the user's device.",
  "best_flag": "Best Flag",
  "best_flag_description": "Best Flag is an exciting project that will put your cryptographic and steganographic skills to the test. The aim is to discover a secret message hidden in the “best_flag” file, using different encryption algorithms.",
  "smart_vt": "Smart VT",
  "smart_vt_description": "Smart VT is an Artificial Intelligence based web application designed to subtitle and dub any video from one language to another (depending on your choice). The project relies on React, Python APIs for video processing, and Node.js for subtitling.",
  "payement_generate_link": "Payment Link Generator",
  "payement_generate_link_description": "This Laravel project is an MTN MOMO Benin payment link generation application, designed to simplify the online payment process for users and administrators.",

  "smart_parking_mobile_app": "Smart Parking – Mobile Application",
  "smart_parking_mobile_app_description": "A mobile app allowing users to reserve a parking space, make partial payments, and get a secure access code. Built with React Native and FastAPI for real-time communication via WebSocket.",

  "smart_parking_aiot_system": "Smart Parking – AIoT System",
  "smart_parking_aiot_system_description": "An intelligent parking system using ESP32 sensors and YOLO-based computer vision to detect vehicles, manage access, and guide users to free spaces. Integrates with the mobile app for real-time updates.",

  "smart_parking_dashboard": "Smart Parking – Admin Dashboard",
  "smart_parking_dashboard_description": "A web dashboard for administrators to monitor reservations, payments, and real-time parking availability. Developed with React.js and Tailwind CSS, with WebSocket for instant updates.",

  "oremi_timo": "Oremi Timo",
  "oremi_timo_description": "OREMI TIMO is an AI insurance platform that automates data entry via OCR, offers a voice chatbot accessible to visually impaired users, and recommends reliable partners based on location.",

  "bio_presence": "Bio Presence System",
  "bio_presence_description": "Bio Presence System is a solution combining a FastAPI backend and ESP32 embedded programs to manage employee attendance using double authentication (personal code + fingerprint).",

  "onboarding": "Onboarding App",
  "onboarding_description": "An animated and interactive onboarding path for the mobile application, developed in React Native with Expo, Tailwind CSS (NativeWind) and a modular component architecture.",

  "see": "VIEW THIS PROJECT",
  "award_hackathonIA_title": "AI HACKATHON",
  "award_hackathonIA_organization": "Agency of Information Systems and Digital Technology (ASIN) - Benin",
  "award_hackathonIA_theme": "AI for the benefit of our local languages",
  "award_hackathonIA_date": "May 2024",
  "award_hackathonIA_range": "Third Prize",
  "award_hackathonIA_description": "Web application based on artificial intelligence that allows subtitling and translating any video from one language to another, including our local languages",
  "award_auf_title": "DIGITAL HACKATHON 2023 by AUF BENIN",
  "award_auf_organization": "Francophonie University Agency (AUF) in Benin",
  "award_auf_theme": "Digital solutions that will make a difference for your university or environment",
  "award_auf_date": "December 2023",
  "award_auf_range": "Participant",
  "award_auf_description": "Web platform for online interview simulation with questions generated by ChatGPT.",
  "award_maic_title": "MIFY Artificial Intelligence Contest (MAIC) sixth edition",
  "award_maic_organization": "Machine Intelligence For You (MIFY)",
  "award_maic_theme": "Propose an Artificial Intelligence capable of playing the Morabaraba game",
  "award_maic_date": "November - December 2022",
  "award_maic_range": "First Prize",
  "award_maic_description": "AI using only functional programming for basic functions.",
  "award_ewaste_title": "Digital and Environmental Education Evening (SENE)",
  "award_ewaste_organization": "Benin E-Waste",
  "award_ewaste_theme": "Digital Solution for the Management of Waste from Electrical and Electronic Equipment (WEEE)",
  "award_ewaste_date": "January - March 2023",
  "award_ewaste_range": "Second Prize",
  "award_ewaste_description": "Web platform for awareness, collection, sale, and repair of refurbished equipment.",
  "award_yats_title": "YATS HACKATON 2022",
  "award_yats_organization": "You Are The Solution (YATS)",
  "award_yats_theme": "Access to Art and Culture through digital",
  "award_yats_date": "December 2022",
  "award_yats_range": "Third Prize",
  "award_yats_description": "Mobile gaming application highlighting the art and culture of Benin.",

  "award_hackathonSmartCities_title": "Smart Cities Hackathon",
  "award_hackathonSmartCities_organization": "Ratheil Foundation for Responsible and Efficient AI in Africa (FRIARE)",
  "award_hackathonSmartCities_theme": "Smart Cities",
  "award_hackathonSmartCities_date": "April 2025",
  "award_hackathonSmartCities_range": "1st Prize",
  "award_hackathonSmartCities_description": "Development of an intelligent parking management system based on AIoT, featuring online booking, secure access, vehicle detection via computer vision, and real-time supervision.",

  "award_hackathonLevelUp_title": "Hackathon Level Up",
  "award_hackathonLevelUp_organization": "AFG Assurances & Future Studio",
  "award_hackathonLevelUp_theme": "Artificial Intelligence for Insurance",
  "award_hackathonLevelUp_date": "June 2025",
  "award_hackathonLevelUp_range": "1st Prize",
  "award_hackathonLevelUp_description": "Developed an intelligent insurance solution that automates data entry via OCR, assists users with a voice chatbot accessible to visually impaired individuals, and recommends reliable partners based on their location.",

  "all": "All",
  "data_science": "Data Science",
  "web": "Web",
  "mobile": "Mobile",
  "programming": "Programming",
  "websocket": "WebSocket",
  "iot": "Internet of Things",
  "ai": "Artificial Intelligence",
  "cyber_security": "Cyber Security",
  "contact_section": {
    "welcome_message": "Welcome to my contact section! If you want to discuss exciting projects, ask questions, or just say hello, feel free to send me a message. I'm always excited to meet new contacts and explore new collaboration opportunities.",
    "contact_info": {
      "phone": "Phone",
      "city": "City",
      "email": "Email"
    },
    "phone_number": "+229 59105267",
    "city": "Abomey-Calavi, Benin",
    "email": "dedjinoucharlotjoel@gmail.com",
    "contact_alternative": "You can also contact me by clicking on any of the icons below."
  },
  "quote": "Success is not the key to happiness. Happiness is the key to success. If you love what you are doing, you will be successful."
}
