{
  "hello": "Bonjour tout le monde !",
  "fr": "Français",
  "en": "Anglais",
  "home": "Accueil",
  "about": "À propos",
  "services": "Services",
  "projects": "Projets",
  "awards": "Distinctions",
  "certifications": "Certifications",
  "contact": "Contact",
  "preferences": "Préférences",
  "download": "Télécharger",
  "profil_1": "Je suis un Ingénieur Logiciel",
  "profil_2": "Je suis un Data Scientist",
  "profil_3": "Je suis passionné par l'IA",
  "profil_4": "Je suis passionné par l'IoT",
  "short_description": "Passionné par l'innovation technologique, je crois fermement au pouvoir de la technologie pour résoudre les problèmes du monde réel dans divers domaines.",
  "description": "Je suis Charlot DEDJINOU, un professionnel passionné par la technologie. En tant que développeur, data scientist et passionné d'intelligence artificielle et d'Internet des objets, je m'engage à créer des solutions innovantes pour relever les défis du monde réel. Avec une expertise diversifiée, je suis déterminé à repousser les limites de la technologie pour façonner un avenir meilleur.",
  "experience": "Expérience",
  "degree": "Diplôme",
  "website": "Site web",
  "city": "Ville",
  "licence": "Licence",
  "email": "Email",
  "phone": "Téléphone",
  "freelance": "Freelance",
  "remote": "À distance",
  "linkedln": "LinkedIn",
  "github": "GitHub",
  "available": "Disponible",
  "benin": "Bénin",
  "view": "Voir",
  "education": "Éducation",
  "professional_experience": "Expérience professionnelle",
  "my": "Mes",
  "developer_frontend": "Développeur Web Frontend",
  "developer_fullstack": "Développeur Full-Stack",
  "years": "Ans",
  "place": "Lieu",
  "skills": "Compétences",
  "fusion_sites": "Fusion de trois sites WordPress en une plateforme unifiée.",
  "react_frontend": "Utilisation de React JS (frontend)",
  "troubleshooting": "Résolution de problèmes techniques et débogage",
  "uml_modeling": "Modélisation du site en utilisant le langage UML",
  "figma_mockup": "Réalisation de la maquette avec le logiciel Figma",
  "react_frontend_dev": "Implémentation du front-end utilisant React JS",
  "laravel_api": "Développement de l’API du site en utilisant Laravel",
  "bachelor": "Licence en Génie Logiciel",
  "mastercard": "Boursier de la Mastercard Fondation à l'UAC",
  "bachelor_science": "Baccalauréat Scientifique",
  "ifri": "Institut de Formation et de Recherche en Informatique (IFRI)",
  "university_abomey": "Université d'Abomey-Calavi",
  "cotonou": "CEG L’ENTENTE, Cotonou BÉNIN",
  "web_development": "Développement Web",
  "web_development_description": "Créez des sites web dynamiques et interactifs, offrant une expérience utilisateur exceptionnelle et des fonctionnalités personnalisées.",
  "mobile_apps": "Applications Mobiles",
  "mobile_apps_description": "Concevez des applications mobiles performantes pour iOS et Android, offrant des interfaces utilisateur élégantes et des fonctionnalités innovantes.",
  "api_development": "Développement d'API",
  "api_development_description": "Concevez, développez et déployez des API robustes pour permettre l'intégration et l'interaction entre différentes applications et systèmes.",
  "data_analysis": "Analyse de données",
  "data_analysis_description": "Analysez des ensembles de données complexes pour extraire des insights significatifs et construire des modèles prédictifs.",
  "iot_solutions": "Solutions d'Intégration IoT",
  "iot_solutions_description": "Développez des solutions IoT intelligentes pour collecter, analyser et utiliser les données en vue d'améliorer la prise de décision et l'automatisation.",
  "user_interfaces": "Interface Utilisateur",
  "user_interfaces_description": "Créez des interfaces intuitives et esthétiques pour les sites web et les applications mobiles ainsi que des visuels pour des événements.",
  "stock_master": "Stock Master",
  "stock_master_description": "Stock Master est une application mobile de gestion de stocks puissante et intuitive, conçue pour simplifier la gestion des stocks de produits.",
  "iot_hub" : "Internet of Things Hub",
  "iot_description" : "Découvrez mes projets pratiques en Internet des Objets (IoT) dans ce dépôt GitHub ! Explorez des exemples de code et des démonstrations couvrant divers aspects de l'IoT.",
  "data_science_hub": "Data Science Hub",
  "data_science_hub_description": "Un dépôt regroupant une variété d'exercices pratiques, de projets de formation et de travaux pratiques en data science.",
  "artistic_ecommerce": "Artistic E-commerce",
  "artistic_ecommerce_description": "Une application web développée en React JS offrant une plateforme pour les artisans afin de vendre leurs créations artistiques en ligne.",
  "car_rental_management": "Car Rental Management",
  "car_rental_management_description": "Une application de gestion de location de voitures développée avec PHP, Laravel et MySQL pour une recherche, une réservation et une gestion efficaces.",
  "birthday_celebration_hub": "Birthday Celebration Hub",
  "birthday_celebration_hub_description": "Un site interactif permettant de personnaliser les vœux d'anniversaire avec des visuels, des devinettes pour débloquer des fonctionnalités supplémentaires. Le mot de passe par défaut pour accéder au site est Nerys.",
  "maic_morabaraba_ai": "Maic Morabaraba AI",
  "maic_morabaraba_ai_description": "Une participation au concours Maic International 2022 avec le développement d'une intelligence artificielle capable de jouer au jeu de Morabaraba.",
  "hackathon_sene": "Hackathon SENE",
  "hackathon_sene_description": "Une solution numérique développée lors du concours de la SENE pour simplifier la gestion des Déchets des Équipements Électriques et Électroniques.",
  "python_kattis_solutions": "Python Kattis Solutions",
  "python_kattis_solutions_description": "Un dépôt contenant des solutions pour quelques exercices de Kattis, tous codés en Python, pour résoudre divers problèmes d'algorithmique et de programmation.",
  "websocket_communication": "Websocket Communication",
  "websocket_communication_description": "Une application de communication bidirectionnelle entre un serveur et des clients, permettant l'échange instantané de messages via des websockets et l'enregistrement de messages dans une base de données.",
  "algolia" : "AlgoliaSearch",
  "algolia_description" :  "AlgoliaSearch est une application Laravel qui utilise Algolia pour une recherche avancée. Elle est construite avec le package Algolia Scout Extended version 1.0 et est compatible avec PHP 7.1.3 et Laravel 5.6",
  "event_flow" : "EventFlow",
  "event_flow_description" : "EventFlow est une application de gestion des invités pour un événement. Elle permet d'ajouter, de mettre à jour, de supprimer et de rechercher des invités, de signaler leur présence ou absence, et de générer une statistique globale à la fin de l'événement.",
  "zero_plastic_initiative": "Zero Plastic Initiative",
  "zero_plastic_initiative_description": "Une fonctionnalité développée pour le projet Zéro Déchet Plastique sur le campus d'Abomey Calavi, permettant de générer un lien personnalisé J'y serai pour partager des engagements et des photos sur les réseaux sociaux.",
  "interview_ai_platform": "Interview AI Platform",
  "interview_ai_platform_description": "Une plateforme permettant de simuler un entretien en ligne avec des questions générées par une API basée sur ChatGPT, offrant une expérience réaliste et des suggestions pour les réponses.",
  "treasure_hunt_adventure": "Treasure Hunt Adventure",
  "treasure_hunt_adventure_description": "Une aventure interactive basée sur une application web React, où chaque étape de la quête est une énigme à résoudre pour avancer et découvrir le trésor tant convoité.",
  "tp_knn": "TP kNN",
  "tp_knn_description": "Un travail pratique permettant d'explorer la sélection du nombre de voisins dans l'algorithme des k plus proches voisins (kNN) pour optimiser la précision des modèles de classification ou de régression.",
  "excellence_night_celebration": "Excellence Night Celebration",
  "excellence_night_celebration_description": "Une fonctionnalité développée pour la Nuit de l'Excellence à l'UAC, permettant de générer un lien personnalisé J'y serai pour partager les visuels sur les réseaux sociaux.",
  "tp_mushroom_classification": "TP Mushroom Classification",
  "tp_mushroom_classification_description": "Un travail pratique où une régression logistique et une SVM linéaire sont entraînées pour déterminer la comestibilité des champignons à partir du jeu de données mushrooms de Kaggle.",
  "realtime_chatbot": "RealTime Chatbot",
  "realtime_chatbot_description": "Un projet de messagerie instantanée entre deux personnes en utilisant les websockets, Vue.js pour le frontend et Express.js pour le backend, offrant une expérience de messagerie fluide et réactive.",
  "blog_api": "Blog API",
  "blog_api_description": "Projet de développement d'une API de blog avec Laravel, centrée sur deux modèles : Commentaires et Articles.",
  "virtual_smartphone_experience": "Virtual Smartphone Experience",
  "virtual_smartphone_experience_description": "Un projet présentant un Smartphone virtuel avec plusieurs applications fonctionnelles pour une expérience utilisateur complète, incluant WhatsApp, des jeux, un lecteur multimédia, un planificateur de tâches, etc.",
  "yats_mobile_game_interface": "YATS Mobile Game Interface",
  "yats_mobile_game_interface_description": "Une contribution au développement de l'interface de la page d'accueil d'un jeu mobile mettant en valeur l'art et la culture du Bénin lors de l'événement YATS.",
  "api_deee_manager": "API DEEE Manager",
  "api_deee_manager_description": "Une API développée en PHP pour la gestion efficace des Déchets d'Équipements Électriques et Électroniques (DEEE), permettant la collecte, le suivi et la gestion transparente de ces déchets.",
  "flutter_shared_preferences_demo": "Flutter Shared Preferences Demo",
  "flutter_shared_preferences_demo_description": "Une démonstration de l'utilisation de la bibliothèque Shared Preferences dans Flutter pour la gestion des préférences utilisateur dans une application mobile, offrant un stockage simple et efficace des données clés-valeurs sur l'appareil de l'utilisateur.",
  "see": "VOIR CE PROJECT",
  "award_auf_title": "HACKATHON NUMERIQUE 2023 de l’AUF BENIN",
  "award_auf_organization": "Agence universitaire de la Francophonie (AUF) au Bénin",
  "award_auf_theme": "Solutions numériques qui feront la différence pour votre université ou votre environnement",
  "award_auf_date": "Decembre 2023",
  "award_auf_range": "Participant",
  "award_auf_description": "Plateforme web de simulation d'entretiens en ligne avec des questions générées par ChatGPT.",
  "award_maic_title": "MIFY Artificial Intelligence Contest (MAIC) sixième edition",
  "award_maic_organization": "Machine Intelligence For You  (MIFY)",
  "award_maic_theme": "Proposer une Intelligence Artificielle capable de jouer le jeu de Morabaraba",
  "award_maic_date": "Novembre - Decembre 2022",
  "award_maic_range": "Premier Prix",
  "award_maic_description": "IA utilisant uniquement la programmation fonctionnelle pour les fonctions de base.",
  "award_ewaste_title": "Soirée de l'Éducation Numérique et Environnementale (SENE)",
  "award_ewaste_organization": "Benin E-Waste",
  "award_ewaste_theme": "Solution Numérique pour la gestion des Déchets des Equipements Electriques et Electroniques (DEEE)",
  "award_ewaste_date": "Janvier - Mars 2023",
  "award_ewaste_range": "Deuxième Prix",
  "award_ewaste_description": "Plateforme web de sensibilisation, collecte, vente et réparation d'équipements reconditionnés.",
  "award_yats_title": "YATS HACKATON 2022",
  "award_yats_organization": "You Are The Solution (YATS)",
  "award_yats_theme": "Accès à l'Art et la Culture par le digital",
  "award_yats_date": "Decembre 2022",
  "award_yats_range": "Troisième Prix",
  "award_yats_description": "Application mobile de jeux mettant en avant l'art et la culture du Bénin.",
  "all": "Tout",
  "data_science": "Data Science",
  "web": "Web",
  "mobile": "Mobile",
  "programming": "Programmation",
  "iot" : "Internet des Objets",
  "websocket": "WebSocket",
  "contact_section": {
    "welcome_message": "Bienvenue dans ma section de contact ! Si vous souhaitez discuter de projets passionnants, poser des questions ou simplement dire bonjour, n'hésitez pas à m'envoyer un message. Je suis toujours ravi de rencontrer de nouveaux contacts et d'explorer de nouvelles opportunités de collaboration.",
    "contact_info": {
      "phone": "Téléphone",
      "city": "Ville",
      "email": "Email"
    },
    "phone_number": "+229 59105267",
    "city": "Abomey-Calavi, Bénin",
    "email": "dedjinoucharlotjoel@gmail.com",
    "contact_alternative": "Vous pouvez également me contacter en cliquant sur l'une des icônes ci-dessous."
  },
  "quote": "Le succès n'est pas la clé du bonheur. Le bonheur est la clé du succès. Si vous aimez ce que vous faites, vous réussirez."
}
